package ru.mpei.lectAgent10;

/**
 * паттерное программирование
 *
 * паттерн абзербл - добавление консюмера, и вызов по приходк данных из сокета.
 *
 * паттерны - это стандарные задачи - заранее програмисты подумали - и рассказали ка лучше что-то использовать
 *
 * мементо - сохраняет сосотояние объектов
 * обзербл
 * итератор - последовательно походит все элементы
 * стратегия - это паттерн позволяет менять поведение объекта в зависимоти от того что мы в него передеаем - (интерфейс)
 *
 * поведенческие патенры, патенрын по созданию, структурные
 *
 *
 * поведенческие - странтегия, визитор, чайн из респонсобилити
 *
 * сингл тон - пусть есть сложный объект его нужно создать один раз и везде использовать (Спринг) - это антипаттерн
 * и я хочу его забирать откуда угодно (пример статик поле - только в качестве объекта!!)
 * пример ЮДПИ сервер - тот который описан У РЕИ в лекции 21
 * у сингл тона прайвет конструктор - НИКТО НЕ ДОЛЖЕН ЕГО СОЗДАВАТЬ
 *
 *
 * на собесе ни в коем слуе не говорить про сингл тон, можно обзервер, стратегия
 *
 */


public class Main {
}
