package ru.mpei.lectBestCode;

/**
 * 1 метод помещается в 15 -20 строк и помещаться в страницу
 * читаемость кода превыше всего!
 *
 * комментарии пишутся над публичными методами
 * что вход, что выход
 *
 * ну если описываем все то хорошо бы описать класс
 *
 * не надо писать код под будущую функциональность!!! Не повторяй ошибку РЕИ
 *
 * в трай кэтч не оборачиваем весь метод, а то что может выдать исключение
 * это может затруднить поиск исключений
 *
 * лучше не использовать статику
 *
 * стиль написания коды команды - зависит от стиля Лида
 *
 * публичные переменные/метод
 * протектед переменные/метод
 * приват переменные/метод
 *
 * квинтенсенция SOLID
 * метод - исполняет одну ыункцию, а класс общую функциональность
 * объект должен быть единственный которую делает какую то вещь
 *
 *
 */

public class Main {
}
