package ru.mpei.lectAgent3;

import jade.core.Agent;

public class OurAgent extends Agent {

    /**
     * параллельлное поведение - которое позволяет условно паралллеьное действие
     *
     * ParallelBehaviour - дейсвите которое в теории может не закончится
     * параллельное повдение закончится когда закончится любое из поведений добавленных
     * в параллельное
     *
     *
     * создает парарельное поведение, по которому получает 10 соообщений
     */


    /**
     * поведение конечный автомат - помогает настраиватьь шаги выполнения каких то задач
     * FSMBehaviour
     */
    @Override
    protected void setup() {



    }
}
