package ru.mpei.lectAgent8;

/**
 * open closed - открытости закрытости
 *
 * про поддержку кода, второй момент про деньги
 *
 * пока модель не передан в тестирвоание писать в ней можно.
 *
 * не андо переписывть класс когда он уже попал продакшн, его править нельзя если он в библиотектк
 * вместо того чтобы переписывать заново можно использовать наследование.
 * это первый вариант
 *
 * вместо тгго чтобы передать конкретную реализацию используем интерфейсы
 *
 * принцип подстановки с барбары лисков
 * использование наследники базовых классов не должно нести побочных эффектов,
 * сайд эффект - неправильное поведение переменных или эксшепшинов
 *
 * интерфейс сегрегатишен принцип
 * интерфейс должен иметь несколько методов чтобы представлять именно ту функциональность для чего он нужен
 * для реализации класса, если он использует несколько методов из разных интерфейсов луше унаследоваться от него
 *
 * принцип обратной зависимости -
 * если есть какой то ПЛС иммитатор
 * высокоуровнвый не должен зависит от низкоуровненового
 *
 * Абстракция не должна зависить от деталей, детали
 *
 */

public class Main {
}
